app/Containers/AppSection/Post/UI/WEB/Controllers/UpdatePostController.php

    public function edit(Request $request)
    {
        return view('appSection@post::post-edit', [
            'post' => Post::find($request->id)
        ]);
---
select * from "posts" where "posts"."id" = '7' limit 1