app/Containers/AppSection/Authentication/UI/WEB/Controllers/HomePageController.php

    public function __invoke(): View
    {
        return view('appSection@authentication::home', [
            'posts' => Post::with('user')->get()
        ]);
---
select * from `posts`
select * from `users` where `users`.`id` in (1, 2)