app/Filament/Resources/PostResource.php

select "name", "id" from "users" where "name" is not null
---
    public static function form(Form $form): Form
    {
        return $form
        ->schema([
            TextInput::make('title')
                ->required(),
            TextInput::make('content')
                ->required(),
            FileUpload::make('image')
                ->directory('posts/images')
                ->avatar()
                ->downloadable()
                ->imageEditor(),
            Select::make('user_id')
                ->label('User')
                ->options(User::whereNotNull('name')->pluck('name', 'id')->toArray())
                ->required(),
        ]);