app/Containers/AppSection/Post/Tasks/UpdatePostTask.php

    public function run(array $data, $id): Post
    {

        try {
            $post = $this->repository->find($id);
        } catch (ModelNotFoundException $exception) {
            throw new NotFoundException();
        }

        if (isset($data['image'])) {
            $post->clearMediaCollection('image');
            $post->addMedia($data['image'])->toMediaCollection('image');
        }

        $post->update($data);
---
update `posts` set `content` = 'Dora2', `posts`.`updated_at` = '2024-11-14 02:17:50' where `id` = 1